# FaceIsNoGoodForWall Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..WallFailures..::..FaceIsNoGoodForWall Property
BuiltInFailures..::..WallFailures Class See Also
---
Defining face is not suitable for walls.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FaceIsNoGoodForWall { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FaceIsNoGoodForWall As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FaceIsNoGoodForWall {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..WallFailures Class
Autodesk.Revit.DB Namespace